In [2]:
import pandas as pd 
import numpy as np

In [3]:
arr = np.random.randint(1,300,500)
arr

# find out the average of those elements that are greater than 50 and less than 150 
# and also return the no. of elements that satisfie our condition

array([ 35, 179, 264, 173, 148, 256, 144,  42, 149, 103, 185,  56,  74,
       143, 102, 108,  37,  53,  89, 200,  73, 224,  19,  15,  93, 211,
       240, 208, 139, 163, 283,  99, 263, 197, 212, 196,  25, 165, 296,
        14, 158,  46, 232,  29, 240, 288,  42, 198, 146,  54, 215, 108,
         3,  76, 121, 237, 135, 132, 148, 213, 135, 190, 238, 200, 111,
       235, 208, 182,  36, 297,   1, 183,  97, 267,  70,  30,  52,  22,
       168, 177, 287, 133, 101, 231,  31, 178, 112, 188,  84, 279, 222,
       260, 113,   8, 212,  16, 148, 217,   7, 288, 204, 212, 162, 141,
       229, 198, 244, 229, 180,  71, 265, 199, 164, 174,   2, 149,  46,
       166,  41, 194, 251, 261, 227, 122,  95, 207,  74,  10, 271, 194,
       114,  26,  64, 211,  70,  66, 248, 119,  83, 140, 197, 297, 115,
       170,  56,  91,  22, 139,   3,   9, 181,  37,  87, 145,   2,  22,
         7, 184,  70, 263,  18, 121, 209, 217,  97, 105,  57, 199, 193,
         3, 154,  87, 144, 275, 293, 232, 150, 166,  99, 296, 224,  45,
       214,  49, 139,   3, 175, 232, 117, 262, 192, 212, 232,  80,  47,
        34, 166, 290, 107, 149,  19, 214, 191, 290, 207,  89,  43,  23,
       184, 241, 224,  13,  88, 211,  59,  17, 155, 226, 276, 222, 274,
       163, 121,  70, 182, 201, 232, 250, 172, 255, 174, 296, 256,   5,
       209,  91, 247, 186, 123, 174, 264, 179,  89,  94,  77, 172, 177,
        30, 100, 296,  86, 116, 192, 218, 211, 275,  16, 172,   7, 194,
        19, 295, 274, 228,  13, 170, 164, 186,   1, 103,  59,  87,  10,
       230, 109, 228, 272, 209,  26, 275,  53, 212,  13, 254, 102, 198,
       122,  68,  94, 213, 274,  92, 165, 280,  58, 211, 157, 115,  28,
        45, 149, 122, 135, 280, 160, 174, 179, 197,  23, 106, 114, 114,
       244, 238,  50,  82,  22,  48,  96, 100,  49, 289, 241, 291, 292,
         1,  38, 238, 149,  99, 296, 262,  77,  16, 186,  32, 244,  91,
       174, 133,  61, 299, 203,  63, 110,  19,  46, 112, 239, 141, 136,
       241, 122, 149,  67, 123,  29, 211, 272, 240, 169, 187, 136,  27,
       125,  85, 126,  33, 230, 161, 182, 294,  14,  79, 149, 175,  93,
        70, 256, 256, 209,  95, 265,  37, 241, 134, 231,  73, 120,  61,
       283, 233,  15,  58, 110, 222,  44, 289,  72, 147, 279, 255,  32,
       286, 116, 169, 106, 168, 188, 241, 161,  67, 219, 123,   4, 200,
       266, 140,  29,  84,  63, 197,   9,  91, 113, 120, 154, 186, 279,
       238, 131, 155, 277, 146, 249, 102,   5, 106, 191, 201,  60,  80,
       124, 229, 141, 280,  56, 160, 248, 203, 143, 139, 169,   4, 207,
        91, 298,  97, 277,  98, 284,  23, 253, 157,  11, 108,  39, 246,
       181, 145,  68,  80,  47,  50,  69, 295, 265, 157,  31,  85, 190,
       168,  61,  16, 165, 159,   2,  29, 181, 282,   5, 207,  68, 154,
       282,  57, 148, 171, 223, 242])

In [6]:
# Data frame create using dictionary 

data = {"Name":['Rishi','Harshit','kartik','yash'],
       "Subject":['physics','chemistry' , 'physics','computer science'],
       "college":['poornima','biet','lord','jecrc']}

data

{'Name': ['Rishi', 'Harshit', 'kartik', 'yash'],
 'Subject': ['physics', 'chemistry', 'physics', 'computer science'],
 'college': ['poornima', 'biet', 'lord', 'jecrc']}

In [5]:
df = pd.DataFrame(data)
df

      Name           Subject   college
0    Rishi           physics  poornima
1  Harshit         chemistry      biet
2   kartik           physics      lord
3     yash  computer science     jecrc

In [8]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df['Name']

0      Rishi
1    Harshit
2     kartik
3       yash
Name: Name, dtype: object

In [11]:
type(df['Name'])

pandas.core.series.Series